#encoding: utf-8
namespace :maintain do
  desc "为系统构建省份数据"
  task :build_sys_prov => :environment do
		@provs = %w{上海@31 云南@53 兵团@? 内蒙古@15 北京@11 吉林@22 四川@51 天津@12 宁夏@64 安徽@34 山东@37 山西@14 广东@44 广西@45 新疆@65 江苏@32 江西@36 河北@13 河南@41 浙江@33 海南@46 湖北@42 湖南@43 甘肃@62 福建@35 西藏@54 贵州@52 辽宁@21 重庆@50 陕西@61 青海@63 黑龙江@23 }

		@provs.each do |prov|
      puts "#{prov}..."
      @split = prov.split("@")
			@prov = SysProvince.where(:name => @split[0], :note => "maintained by task").first_or_create
      @prov.code = @split[1]
      @prov.save
		end
	end

  desc "为系统构建大类数据"
  task :build_a_category => :environment do
    @categories = %w{ 粮食及粮食制品 食用油、油脂及其制品 肉及肉制品 蛋及蛋制品 蔬菜及其制品 水果及其制品 水产及水产制品 饮料 调味品 食糖 酒类 焙烤食品 茶叶及其相关制品、咖啡 薯类及膨化食品 糖果及可可制品 炒货食品及坚果制品 豆类及其制品 蜂产品 冷冻饮品 罐头 乳制品 特殊膳食食品 食品添加剂 餐饮食品 }

    @categories.each do |category|
      puts "#{category}..."
      ACategory.where(:name => category, :note => "maintained by task").first_or_create
    end
  end

  desc "为系统构建类别数据"
  task :build_all_category => :environment do
    @spdl = ['请选择','食用油、油脂及其制品','肉及肉制品','蛋及蛋制品','水果及其制品','饮料','食糖','酒类','茶叶及其相关制品、咖啡','薯类及膨化食品','糖果及可可制品','豆类及其制品','蜂产品','冷冻饮品','罐头','炒货食品及坚果制品','餐饮食品','乳制品','粮食及粮食制品','食品添加剂','焙烤食品','特殊膳食食品','蔬菜及其制品','水产及水产制品','调味品'];
    @spyl = [['请选择'],['食用植物油'],['生鲜肉','预制肉制品','熟肉制品'],['鲜蛋','蛋制品'],['新鲜水果类','水果制品'],['饮料'],['食糖'],['蒸馏酒','发酵酒','配制酒'],['茶叶','含茶制品和代用茶'],['薯类及膨化食品'],['糖果制品(含巧克力及制品)'],['豆类','豆制品'],['蜂产品'],['冷冻饮品'],['罐头'],['炒货食品及坚果制品'],['食用冰（含现场制售）','米面及其制品（自制）','肉制品（自制）','酱腌菜（自制）','水产加工品（自制）','复合调味料（自制）','糕点（自制）','冰淇淋、雪糕（自制）','餐饮店和饮品店自制饮料等','餐饮套餐','凉拌菜','餐饮原材料','节令食品','餐饮具'],['乳制品'],['小麦粉','大米','挂面','其他粮食加工品','淀粉及淀粉制品','方便食品','速冻面米食品'],['食品添加剂'],['糕点','饼干'],['婴幼儿配方食品','婴幼儿辅助食品','其他配方谷粉'],['蔬菜','蔬菜制品'],['水产品','水产制品'],['酱油','食醋','酱类','调味料','味精','鸡精调味料']];
    @spcyl = [[['请选择']],[['食用植物油','煎炸过程用油（餐饮环节）']],[['畜禽肉','畜禽内脏'],['调理肉制品','速冻调制肉制品','腌腊肉制品'],['发酵肉制品','酱卤肉制品','熏烧烤肉制品　','熏煮香肠火腿制品　']],[['鲜蛋'],['再制蛋','干蛋类','冰蛋类','其他类']],[['柑橘类、梨果类、核果类、浆果和其他小粒水果、瓜果类、热带及亚热带水果'],['蜜饯','水果干制品','果酱']],[['瓶(桶)装饮用水','果、蔬汁饮料','蛋白饮料','碳酸饮料（汽水）','茶饮料','固体饮料','其他饮料']],[['食糖']],[['白酒','其他蒸馏酒'],['黄酒','啤酒','葡萄酒及果酒','其他发酵酒'],['配制酒']],[['茶叶','砖茶'],['含茶制品','代用茶']],[['膨化食品']],[['糖果','巧克力及巧克力制品','果冻']],[['黄豆、绿豆、红豆等'],['发酵性豆制品','非发酵性豆制品']],[['蜂蜜','蜂王浆（含蜂王浆冻干品）','蜂产品制品']],[['冷冻饮品']],[['畜禽水产罐头','果蔬罐头']],[['炒货食品及坚果制品（烘炒类、油炸类、其他类）']],[['食用冰（含现场制售）'],['小麦粉制品（自制）','大米制品（自制）'],['生食肉类产品（自制）','预制肉制品（自制）','熟肉制品（自制）'],['酱腌菜（自制）'],['生食水产品（自制）'],['半固态调味料（自制）'],['糕点、面包（自制）'],['冰淇淋、雪糕（自制）'],['自制饮料'],['外卖套餐','学生餐'],['植物性、动物性和混合性凉拌菜'],['动物源性食品'],['元宵节食品','端午节食品','中秋节食品'],['复用餐饮具','一次性餐饮具']],[['液体乳','乳粉','其他乳制品（炼乳、奶油、干酪、固态成型产品）']],[['小麦粉'],['大米'],['挂面'],['谷物碾磨加工品','谷物粉类制成品'],['淀粉','淀粉制品'],['方便面','其他方便食品'],['速冻面米食品']],[['增稠剂','复配食品添加剂','食品用香精']],[['糕点（烘烤类、油炸类、蒸煮类、熟粉类、月饼）'],['饼干']],[['婴儿配方食品','较大婴儿和幼儿配方食品'],['婴幼儿谷类辅助食品','婴幼儿罐装辅助食品'],['其他配方谷粉']],[['新鲜蔬菜（含冬季大棚蔬菜）'],['酱腌菜','蔬菜干制品','食用菌制品','速冻蔬菜和其他蔬菜制品']],[['淡水鱼类','海水鱼类','贝类、织纹螺','牡蛎、毛蚶等生食贝类水产品','软体动物','预制动物性水产品（半成品）','水发产品'],['干制水产品','盐渍水产品','鱼糜制品','水产调味品','风味鱼制品','生食水产品']],[['酱油'],['食醋'],['酱类'],['固态调味料','半固态调味料','液体调味料','食用调味油'],['味精'],['鸡精调味料']]];
    @spxl = [[[['请选择']]],[[['玉米油','花生油','其他食用植物油'],['煎炸过程用油']]],[[['鸡肉、牛肉、羊肉、猪肉、其他畜禽肉（猪肉、牛肉、羊肉1:1:2）（根据当地消费情况选择监测样品和数量）'],['肝脏、肾脏、其他内脏（猪肝、牛肝、羊肝1:1:2）（根据当地消费情况选择监测样品和数量）']],[['冷冻肉糜制品（牛肉丸等）','其他调理肉制品（含生肉添加调理料）'],['速冻调制肉制品'],['火腿腊肉、咸肉、灌肠制品、非烟熏和烟熏板鸭等']],[['发酵肉制品'],['酱卤肉制品、熟肉干制品'],['熏烧烤肉制品　'],['熏煮香肠火腿制品　']]],[[['鲜蛋']],[['皮蛋（松花蛋）','其他再制蛋'],['干蛋类'],['冰蛋类'],['其他类']]],[[['苹果、梨、桃、荔枝、龙眼、柑橘等']],[['蜜饯类、凉果类、果脯类、话化类、果丹（饼）类、果糕类'],['水果干制品'],['果酱']]],[[['纯净水','天然矿泉水','其他瓶(桶)装饮用水'],['果、蔬汁饮料'],['含乳饮料','其他蛋白饮料（植物蛋白、复合蛋白）'],['碳酸饮料（汽水）'],['茶饮料'],['固体饮料'],['其他饮料']]],[[['白砂糖、绵白糖、赤砂糖、冰糖、方糖、冰片糖等']]],[[['白酒、白酒（液态）、白酒（原酒）'],['其他蒸馏酒']],[['黄酒'],['熟啤酒、生啤酒、鲜啤酒、特种啤酒'],['葡萄酒','果酒（李子酒、杨梅酒、樱桃酒等）'],['其他发酵酒']],[['以蒸馏酒及食用酒精为酒基的配制酒','以发酵酒为酒基的配制酒']]],[[['绿茶、红茶、乌龙茶、黄茶、白茶、黑茶、花茶、袋泡茶、紧压茶'],['黑砖茶、花砖茶、茯砖茶、康砖茶、金尖茶、青砖茶、米砖茶等']],[['速溶茶类、其他含茶制品'],['代用茶']]],[[['油炸型膨化食品和非油炸型膨化食品']]],[[['夹心糖果、焦香糖果、充气糖果、硬质糖果、抛光糖果、凝胶糖果、胶基糖果'],['巧克力、巧克力制品、代可可脂巧克力及代可可脂巧克力制品'],['果冻']]],[[['黄豆']],[['腐乳等'],['腐竹、油皮','豆干、豆腐、豆皮(含即食豆制品)等']]],[[['蜂蜜'],['蜂王浆（含蜂王浆冻干品）'],['蜂产品制品']]],[[['冰淇淋、雪糕、雪泥、冰棍、食用冰、甜味冰']]],[[['畜禽肉类罐头','鱼类等水产罐头'],['果蔬罐头']]],[[['开心果、杏仁、松仁、瓜子','其他炒货食品及坚果制品']]],[[['食用冰（现场制售）']],[['生湿面制品（餐饮自制）','发酵面制品（餐饮自制）'],['米粉、米线（自制）','其它米类自制品']],[['生食肉类产品（自制）'],['火腿腊肉、咸肉、灌肠制品、非烟熏和烟熏板鸭（自制）'],['发酵肉制品、酱卤肉、肴肉、肉灌肠、肉干、肉脯、肉松、其他熟肉干制品、烧烤肉、熏煮火腿（自制）','肉冻、皮冻、水晶肘子、水晶肠等（自制）']],[['酱腌菜（自制）']],[['生食（含腌制）动物性水产品（寿司、刺身、鱼生）']],[['辣椒酱（自制）','火锅底料、麻辣烫底料及蘸料（自制）']],[['冷加工糕点、面包（自制）','热加工糕点、面包（自制）']],[['冰淇淋、雪糕（自制）']],[['果、蔬汁等饮料（自制）','其他自制饮料']],[['外卖配送餐','盒饭'],['学生餐']],[['植物性、动物性和混合性凉拌菜']],[['鸭血豆腐、猪血豆腐（自制）']],[['汤圆、元宵（自制）'],['粽子（自制）'],['月饼（自制）']],[['餐馆用餐饮具'],['纸杯、食品包装纸、纸质食品包装盒、碗和桶','塑料餐饮具']]],[[['灭菌乳','巴氏杀菌乳','调制乳','发酵乳'],['全脂乳粉、脱脂乳粉、部分脱脂乳粉、调制乳粉'],['淡炼乳、加糖炼乳和调制炼乳','稀奶油、奶油和无水奶油','干酪(奶酪)、再制干酪','奶片、奶条等']]],[[['通用小麦粉、专用小麦粉']],[['大米']],[['普通挂面、花色挂面、手工面']],[['玉米粉、玉米片、玉米碴','米粉','其他谷物碾磨加工品'],['生湿面制品','发酵面制品','米粉制品','其他谷物粉类制成品']],[['淀粉'],['粉丝粉条等']],[['油炸面、非油炸面','方便面调味包'],['方便粥、方便盒饭、冷面及其他熟制方便食品等']],[['水饺、汤圆元宵、馄饨等','包子、馒头等']]],[[['明胶'],['复配面粉改良剂','其他复配食品添加剂'],['咸味香精','其他香精','食品用香精']]],[[['冷加工糕点','热加工糕点']],[['饼干']]],[[['婴儿配方乳粉（湿法工艺、干法工艺、干湿法混合工艺）、豆基婴儿配方粉'],['较大婴儿和幼儿配方乳粉（湿法工艺、干法工艺、干湿法混合工艺）、豆基较大婴儿和幼儿配方粉']],[['婴幼儿谷物辅助食品、婴幼儿高蛋白谷物辅助食品、婴幼儿生制类谷物辅助食品、婴幼儿饼干或其他婴幼儿谷物辅助食品'],['泥（糊）状罐装食品、颗粒状罐装食品、汁类罐装食品']],[['其他配方谷粉']]],[[['豆芽菜','其他蔬菜','鲜食用菌']],[['酱腌菜'],['自然干制品、热风干燥蔬菜、冷冻干燥蔬菜、蔬菜脆片蔬菜粉及制品'],['干制食用菌','腌渍食用菌'],['速冻蔬菜','其他蔬菜制品']]],[[['鲜活淡水鱼类'],['海水鱼类'],['新鲜贝类、织纹螺'],['牡蛎、毛蚶等生食贝类水产品'],['软体动物，鱿鱼、章鱼、河蚌、田螺、墨鱼、海参、海肠(水发产品除外)'],['预制动物性水产品（半成品）'],['海参、鱿鱼、墨鱼、干贝等']],[['藻类加工制品','烤鱼片（含散装）','其他动物性水产干制品'],['盐渍鱼','盐渍藻','其他盐渍水产品'],['冷冻挂浆制品、冷冻鱼糜制品（鱼丸、虾丸等）','即食类鱼糜制品（含虾糜）、非即食类鱼糜制品（含虾糜）','其他鱼糜制品'],['水产调味品'],['熟制动物性水产品（可直接食用）等'],['生食（含腌制）动物性水产品（寿司、刺身、鱼生）','其他生食水产品']]],[[['酿造酱油、配制酱油（酿造和配制按2:1）']],[['酿造食醋、配制食醋']],[['黄豆酱、甜面酱等']],[['鸡粉','复合香辛料','辣椒、花椒、辣椒粉、花椒粉','大料、大料粉','其他固态调味料'],['沙拉酱','辣椒酱','坚果与籽类的泥（酱），包括花生酱、芝麻酱等','火锅底料、麻辣烫底料及蘸料','其他半固态调味料'],['蚝油、虾油','料酒','其他液体调味料'],['辣椒油','其他调味油']],[['味精']],[['鸡精调味料']]]];

    ACategory.destroy_all
    BCategory.destroy_all
    CCategory.destroy_all
    DCategory.destroy_all

    @spdl.each_with_index do |dl, dl_index|
      puts "(大)#{dl}"
      a_category = ACategory.create(name: dl, id: dl_index, note: "build from rake task") unless dl.eql?('请选择')

      @spyl[dl_index].each_with_index do |yl, yl_index|
        puts "  (亚)#{yl}"
        b_category = BCategory.create(name: yl, id: yl_index, a_category_id: a_category.id, note: "build from take task") unless yl.eql?('请选择')
        @spcyl[dl_index][yl_index].each_with_index do |cyl, cyl_index|
          puts "   (次)#{cyl}"
          c_category = CCategory.create(name: cyl, id: cyl_index, a_category_id: a_category.id, b_category_id: b_category.id, note: "build from rake task" ) unless cyl.eql?('请选择')
          @spxl[dl_index][yl_index][cyl_index].each do |xl, xl_index|
            puts "    (细)#{xl}"
            d_category = DCategory.create(name: xl, id: xl_index, a_category_id: a_category.id, b_category_id: b_category.id, c_category_id: c_category.id, note: "build from rake task" ) unless xl.eql?('请选择')
          end
        end
      end
    end
  end
end
